_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СтроительныеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_СтроительныеРаботы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.УСОERP_СценарииПланированияПроектовСтроительства</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСДР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяСводногоСметногоРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтатьиСводныхСметныхРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКонструктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Конструктив</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРаботыВУровне</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммарнаяРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UIDProject</Name>
					<Comment>Служебный реквизит, предназначен для хранения UID, загруженных из MSProject</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Веха</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КритическаяРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедущийПроцесс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляПроекта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРаботыВУровнеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задержка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаЗадержки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПредшественники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОграничения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ТипыОграничений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОграничения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадержкаОграничения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботаИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРесурсы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПредшественников</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ресурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗагрузкаПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Календари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Трудоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Машиноемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНаЕдиницуОбъема</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковокНаЕдиницуОбъема</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНаОбъемРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковокНаОбъемРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Предшественники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтроительнаяРабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗависимости</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ТипыЗависимостейРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задержка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаЗадержки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Конструктивы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Конструктив</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Конструктив</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ТипыОграничений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ТипыОграничений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КакМожноРаньше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КакМожноПозже</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоНеРанее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоНеПозднее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеНеРанее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеНеПозднее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеНачало</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеОкончание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СтроительныеРаботы/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Перем СтарыйРодитель;
Перем НовыйРодитель;

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Владелец.НовыйВариант Тогда
		
		Если ТипОграничения = Перечисления.УСОERP_ТипыОграничений.НачалоНеПозднее 
			ИЛИ   ТипОграничения = Перечисления.УСОERP_ТипыОграничений.НачалоНеРанее 
			ИЛИ   ТипОграничения = Перечисления.УСОERP_ТипыОграничений.ОкончаниеНеПозднее 
			ИЛИ   ТипОграничения = Перечисления.УСОERP_ТипыОграничений.ОкончаниеНеРанее 
			ИЛИ   ТипОграничения = Перечисления.УСОERP_ТипыОграничений.ФиксированноеНачало 
			ИЛИ   ТипОграничения = Перечисления.УСОERP_ТипыОграничений.ФиксированноеОкончание 
			Тогда
			ПроверяемыеРеквизиты.Добавить("ДатаОграничения");
		КонецЕсли;
		
		
			ПроверяемыеРеквизиты.Добавить("ЕдиницаДлительности");
	
		
		
	Иначе
		
		МассивВсехРеквизитов = Новый Массив;
		МассивРеквизитовОперации = Новый Массив;
		МассивНепроверяемыхРеквизитов = Новый Массив;
		
		ОбщегоНазначенияУТКлиентСервер.ЗаполнитьМассивНепроверяемыхРеквизитов(
		МассивВсехРеквизитов,
		МассивРеквизитовОперации,
		МассивНепроверяемыхРеквизитов);
		
		
		//ПараметрыПроверки = НоменклатураСервер.ПараметрыПроверкиЗаполненияХарактеристик();
		//ПараметрыПроверки.ИмяТЧ = "Материалы";
		//НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект,МассивНепроверяемыхРеквизитов,Отказ, ПараметрыПроверки);
		//ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)	
		
	Если Владелец.НовыйВариант Тогда
		
		Если ДополнительныеСвойства.Свойство("КопированиеСценария") Тогда
			
			ЕстьПредшественники = Предшественники.Количество();
			ЕстьРесурсы = Ресурсы.Количество();
			НомерРаботыВУровнеСтрокой = Формат(НомерРаботыВУровне,"ЧГ=0");
			
			Возврат;
			
		КонецЕсли;
		
	СуммарнаяРабота = ЕстьПодчиненныеРаботы();
	ЕстьПредшественники = Предшественники.Количество();
	ЕстьРесурсы = Ресурсы.Количество();
	
	Если ПометкаУдаления Тогда
		НомерРаботыВУровне = 9999;
		Возврат;
	КонецЕсли;  	
	
	Если (ЭтоНовый() И НомерРаботыВУровне = 0) ИЛИ (Ссылка.ПометкаУдаления И НЕ ПометкаУдаления) Тогда
		
		НомерРаботыВУровне = 1;
		Сч = 1;
		
		ПересчитатьНомераВУровне(Родитель,Владелец,Сч);
		
		НомерРаботыВУровне = Сч;
		
	Иначе  
		
		Если Родитель <> Ссылка.Родитель Тогда 		
			
			Если ЭтоНовый() И НомерРАботыВУровне <> 0 Тогда
			Иначе
				
			Сч = 1;
			ПересчитатьНомераВУровне(Ссылка.Родитель,Владелец,Сч,Ссылка);
			Если Сч = 1 И ЗначениеЗаполнено(Ссылка.Родитель) Тогда//родитель стал пустым, надо б ему длительность поправить
				СтарыйРодитель = Ссылка.Родитель;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Родитель) Тогда
				НовыйРодитель = Родитель;
			КонецЕсли;		
			Сч = 1;
			ПересчитатьНомераВУровне(Родитель,Владелец,Сч);
			НомерРаботыВУровне = Сч;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;  	
	
	НомерРаботыВУровнеСтрокой = Формат(НомерРаботыВУровне,"ЧГ=0");
	
	Если НЕ ЗначениеЗаполнено(ГрафикРаботы) Тогда
		ГрафикРаботы = Владелец.Владелец.ГрафикРаботы;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЕдиницаДлительности) Тогда
		ЕдиницаДлительности = Владелец.Владелец.ЕдиницаДлительности;
	КонецЕсли;
	
	Если НЕ ЗНачениеЗаполнено(ЕдиницаЗадержки) Тогда
		ЕдиницаЗадержки = Владелец.Владелец.ЕдиницаДлительности;
	КонецЕсли; 
	
	Если СуммарнаяРабота  Тогда
		
		Ресурсы.Очистить();
		Материалы.Очистить();
		Длительность = 0;
		ОбъемРаботы = 0;
		ЭтотОбъект.ЕдиницаОбъема = "";
		Предшественники.Очистить();
		Если НЕ ЗначениеЗаполнено(ЕдиницаДлительности) Тогда
			ЕдиницаДлительности = Владелец.Владелец.ЕдиницаДлительности;
		КонецЕсли;
		
	//	ЕдиницаДлительности = Перечисления.ЕдиницыИзмеренияВремени.День;
		
	КонецЕсли;	
	
	Если НЕ ЭтоНовый() Тогда	
		
		Если СуммарнаяРабота Тогда
			Длительность = 0;
			Задержка = 0;
			ПредыдущаяРабота = Справочники.УСОERP_СтроительныеРаботы.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;	
	
	Если Не СуммарнаяРабота Тогда
		Если Длительность = 0 Тогда
			Длительность = 1;
		КонецЕсли;
	КонецЕсли; 
	
	Строки = Предшественники.НайтиСтроки(Новый Структура("ЕдиницаЗадержки",Перечисления.ЕдиницыИзмеренияВремени.ПустаяСсылка()));
	Для Каждого НайденнаяСтрока ИЗ Строки Цикл
		НайденнаяСтрока.ЕдиницаЗадержки =  ЕдиницаДлительности;
	КонецЦикла;
	//<<+++  
	
	Для Каждого СтрокаМатериалов ИЗ Материалы Цикл
		
		Если СтрокаМатериалов.КоличествоНаОбъемРаботы = 0 Тогда
			
			СтрокаМатериалов.КоличествоНаОбъемРаботы = СтрокаМатериалов.КоличествоНаЕдиницуОбъема*ОбъемРаботы;
			СтрокаМатериалов.КоличествоУпаковокНаОбъемРаботы = СтрокаМатериалов.КоличествоУпаковокНаЕдиницуОбъема*ОбъемРаботы;
			
		КонецЕсли;
		
	КОнецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ТипОграничения) Тогда
		ДатаОграничения = Дата(1,1,1);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаОграничения) Тогда
		Если ТипОграничения = Перечисления.УСОERP_ТипыОграничений.КакМожноПозже ИЛИ 
			ТипОграничения = Перечисления.УСОERP_ТипыОграничений.КакМожноРаньше Тогда
		Иначе
			ТипОграничения = Перечисления.УСОERP_ТипыОграничений.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
		
	Иначе
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		ДополнительныеСвойства.Вставить("ЭтоНовый", Истина);
	КонецЕсли;
	
	РеквизитыСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Родитель");
	
	ГрафикРаботы_ОС = Владелец.Владелец.ГрафикРаботы;
	
	Если ЗначениеЗаполнено(ГрафикРаботы_ОС) И ЭтоНовый() И Не ЗначениеЗаполнено(ГрафикРаботы) Тогда
		ГрафикРаботы = ГрафикРаботы_ОС;
	КонецЕсли;
	
	ТекущийРодитель = РеквизитыСсылки.Родитель;
	ДополнительныеСвойства.Вставить("ТекущийРодитель", ТекущийРодитель);
	ДополнительныеСвойства.Вставить("ПометкаУдаления", ?(Ссылка.Пустая(), Ложь, Ссылка.ПометкаУдаления));
	
	
	Если НЕ ПараметрыСеанса.УСОERP_ВыполняетсяЗагрузкаИзProject
		И НЕ ПометкаУдаления
		И ДополнительныеСвойства.Свойство("ЭтоНовый")
		И (ДополнительныеСвойства.ЭтоНовый ИЛИ ПометкаУдаления <> ДополнительныеСвойства.ПометкаУдаления ) Тогда
		
		Запрос	= Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтроительныеРаботы.Ссылка,
		|	СтроительныеРаботы.UIDProject
		|ИЗ
		|	Справочник.УСОERP_СтроительныеРаботы КАК СтроительныеРаботы
		|ГДЕ
		|	СтроительныеРаботы.Владелец = &СценарийПланирования
		|	И СтроительныеРаботы.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтроительныеРаботы.НомерРаботыВУровне,
		|	СтроительныеРаботы.Наименование";
		Запрос.УстановитьПараметр("СценарийПланирования",	Владелец);
		
		Результат	= Запрос.Выполнить();	
		Если Результат.Пустой() Тогда
			UIDProject = "1";
			Возврат;
		КонецЕсли;
		
		ТаблицаРабот = Результат.Выгрузить();
		ТаблицаРабот.Колонки.Добавить("ДопКолонка", Новый ОписаниеТипов("Число"));
		Для Каждого СтрокаРабота Из ТаблицаРабот Цикл
			Если ЗначениеЗаполнено(СокрЛП(СтрокаРабота.UIDProject)) Тогда
				Попытка
					СтрокаРабота.ДопКолонка = Число(СтрокаРабота.UIDProject);
				Исключение
					СтрокаРабота.ДопКолонка = 0;
				КонецПопытки;
			Иначе
				СтрокаРабота.ДопКолонка = 0;
			КонецЕсли;			
		КонецЦикла;
		
		ТаблицаРабот.Сортировать("ДопКолонка Убыв");
		
		Если ТаблицаРабот[0].ДопКолонка = 0 Тогда
			UIDProject = "1";
		Иначе
			НовыйUID = ТаблицаРабот[0].ДопКолонка + 1;
			UIDProject = Строка(СОКРЛП(СтрЗаменить(НовыйUID, Символ(160), "")));
		КонецЕсли;
		
	КонецЕсли;
	
	КонецЕсли;//Новый вариант
	
	НомерРаботыВУровнеСтрокой = Формат(НомерРаботыВУровне,"ЧГ=0");

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	СуммарнаяРабота = Ложь;
	КодСДР = "";
	НомерРаботыВУровне = 0;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Владелец.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если Владелец.НовыйВариант Тогда
		
		Если ДополнительныеСвойства.Свойство("КопированиеСценария") Тогда
			Возврат;
		КонецЕсли;
		
		Если СтарыйРодитель <> Неопределено Тогда
			
			СтарыйРодительОбъект = СтарыйРодитель.ПолучитьОбъект();
			СтарыйРодительОбъект.ОбменДанными.Загрузка = Истина;
			СтарыйРодительОбъект.Записать();
			
		КонецЕсли;
		
		Если НовыйРодитель <> Неопределено Тогда
			
			НовыйРодительОбъект = НовыйРодитель.ПолучитьОбъект();
			НовыйРодительОбъект.ОбменДанными.Загрузка = Истина;
			НовыйРодительОбъект.Записать();
			
		КонецЕсли;  
		
	Иначе 
		
		//Снятие пометки удаления, полагается что происходит ТОЛЬКО при снятии пометки со сценария
		Если НЕ ПометкаУдаления И ДополнительныеСвойства.ПометкаУдаления Тогда
			Возврат;
		КонецЕсли; 
		
		
		// установка признака суммарной работы у родителя
		ТекущийРодитель	= ДополнительныеСвойства.ТекущийРодитель;
		Если Родитель <> ТекущийРодитель Тогда 
			
			Если ЗначениеЗаполнено(ТекущийРодитель) Тогда 
				ЭтоСуммарнаяРабота	= УСОERP_УправлениеСтроительнымПроизводством.ЭтоСуммарнаяРабота(ТекущийРодитель);
				Если ЭтоСуммарнаяРабота <> ТекущийРодитель.СуммарнаяРабота Тогда 
					РодительОбъект 	= ТекущийРодитель.ПолучитьОбъект();
					ЗаблокироватьДанныеДляРедактирования(РодительОбъект.Ссылка);
					РодительОбъект.СуммарнаяРабота	= ЭтоСуммарнаяРабота;
					РодительОбъект.Записать();
				КонецЕсли;
			КонецЕсли;	
			
		КонецЕсли;	
		Если ЗначениеЗаполнено(Родитель) Тогда 
			ЭтоСуммарнаяРабота	= УСОERP_УправлениеСтроительнымПроизводством.ЭтоСуммарнаяРабота(Родитель);
			Если ЭтоСуммарнаяРабота <> Родитель.СуммарнаяРабота Тогда 
				РодительОбъект	= Родитель.ПолучитьОбъект();
				ЗаблокироватьДанныеДляРедактирования(РодительОбъект.Ссылка);
				РодительОбъект.СуммарнаяРабота	= ЭтоСуммарнаяРабота;
				РодительОбъект.Записать();
			КонецЕсли;
		КонецЕсли;	
		
		
		Если ПометкаУдаления <> ДополнительныеСвойства.ПометкаУдаления Тогда
			//УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРРабот(Владелец.Ссылка);
		КонецЕсли;
		
	КонецЕсли;//Новый вариант  
	
КонецПроцедуры

#Область ОбработчикиНовогоВарианта
Функция ЕстьПодчиненныеРаботы()
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	
	Выборка = Справочники.УСОERP_СтроительныеРаботы.Выбрать(Ссылка);
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.ПометкаУдаления Тогда
			Возврат Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьДанныеПоРаботе(Работа) Экспорт
	
	
	
	СтруктураРаботы = Новый Структура;
	СтруктураРаботы.Вставить("ДатаНачала",Дата(1,1,1));
	СтруктураРаботы.Вставить("ДатаОкончания",Дата(1,1,1));
	
	
	
	Возврат СтруктураРаботы;
	
КонецФункции

Процедура ПересчитатьНомераВУровне(ТекРодитель,ТекВладелец,Сч = 1,ПропускаемаяРабота = Неопределено)Экспорт
	
	Выборка = Справочники.УСОERP_СтроительныеРаботы.Выбрать(ТекРодитель,ТекВладелец,,"НомерРаботыВУровне");
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.Ссылка = ПропускаемаяРабота Тогда
			
			Продолжить;
			
		КонецЕсли; 		
		
		Если Выборка.НомерРаботыВУровне <> Сч  Тогда
			
			Выб = Выборка.ПолучитьОбъект();
			Выб.НомерРаботыВУровне = Сч;
			Выб.НомерРаботыВУровнеСтрокой = Формат(Сч,"ЧГ=0");
			Выб.ДополнительныеСвойства.Вставить("КопированиеСценария");
			Выб.Записать();
			
		КонецЕсли;
		
		Сч = Сч+1;
		
	КонецЦикла;  
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
